SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( #RF_BR64xx_6431
 Type ( Engine )
 WagonShape ( RF_BR64xx_6431.s )
 FreightAnim ( crew_07.s 1 1 )
 Size  ( 2.67188m 3.68564m 9.40643m )
 CentreOfGravity ( 0.0m 0.0m 0.0m )
 Centre ( 0m 1.89951m 0m )
 Mass ( 46.33t )
 InertiaTensor ( Box(2.67188m 3.68564m 9.40643m) )
 Coupling (
 Type ( chain )
 Spring (
 Stiffness ( 1e6N/m 2e6N/m )
 Damping ( 1e6N/m/s 1e6N/m/s )
 Break ( 5.1e7N 5.1e7N )
 r0 ( 20cm 40m )
 )
 CouplingHasRigidConnection ()
 Velocity ( 0.1m/s )
 )

 Buffers (
 Spring (
 Stiffness ( 1e6N/m 5e6N/m )
 Damping ( 1e6N/m/s 1e6N/m/s )
 r0 ( 0cm 1e9 )
 )
 Centre ( 1.5 )
 Radius ( 1 )
 Angle ( 2.5deg )
 )

 Adheasion ( 0.5 0.8 0.339 0 )
 DerailRailHeight ( 10cm )
 DerailRailForce ( 2.5*46.33t )
 DerailBufferForce ( 600kN )
 WheelRadius ( 0.485m )
 NumWheels ( 3 )
 Friction (
 917N/m/s        0        1mph   14.69N/m/s      1.8
 5.1N/rad/s       1       -1rad/s     0              1
 )
      IntakePoint ( 0.7 2.4 FuelWater )
 IntakePoint ( -4.78 2.73 FuelCoal )

 BrakeEquipmentType ( "Vacuum_brake, Handbrake, Auxilary_reservoir" )
 BrakeSystemType ( "Vacuum_single_pipe" )
 MaxBrakeForce( 27.80kN )
 MaxHandbrakeForce( 46.33kN )
 NumberOfHandbrakeLeverSteps( 100 )
 MaxReleaseRate( 15 )
 MaxApplicationRate( 10 )
 MaxAuxilaryChargingRate( 15 )
 BrakeCylinderPressureForMaxBrakeBrakeForce( 25 )
        
 Sound ( "..\\..\\common.sound\\2cyl_generic\\#AI-2cyl-60-120-01.sms" )

  Lights ( 13

   Light (
      comment( Flickering firebox )
      Type  ( 0 )
      Conditions (
      Headlight ( 0 )
      Unit ( 0 )
      )
      FadeIn ( 0.5 )
      FadeOut ( 0.5 )
      Cycle ( 0 )
     States ( 2
      State (
      Duration ( 0.05 )
      LightColour ( 80ff7200 )
      Position ( -0 1.75 -2.1 )
      Azimuth ( -180 -180 -180 )
      Transition ( 0 )
      Radius ( 1.4 )
      )
      State (
      Duration ( 0.05 )
      LightColour ( 80ffe610 )
      Position ( -0 1.75 -2.1 )
      Azimuth ( -180 -180 -180 )
      Transition ( 0 )
      Radius ( 1.4 )
         
          )
        )
      )
   Light (
   Comment( Lamp rear Red )
   Type ( 0 )
   Conditions (
   Headlight ( 3 )
   Unit ( 3 )
   )
   Cycle ( 0 )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   States ( 1
   State (
   Duration ( 0.0 )
   LightColour ( 80ff0000 )
   Position ( -0.0896 3.0047 -4.58 )
   Azimuth ( -180 -180 -180 )
   Transition ( 0 )
   Radius ( 0.5 )
   Elevation ( 0.0 -5.0 5.0 )
    )
   )
  )
  Light (
   Comment( Lamp rear White )
   Type ( 0 )
   Conditions (
   Headlight ( 2 )
   Unit ( 3 )
   )
   Cycle ( 0 )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   States ( 1
   State (
   Duration ( 0.0 )
   LightColour ( ff808000 )
   Position ( -0.0896 3.0047 -4.58 )
   Azimuth ( -180 -180 -180 )
   Transition ( 0 )
   Radius ( 0.5 )
   Elevation (0.0 -5.0 5.0 )
    )
   )
  )

  Light (
   Comment( Lamp front white )
   Type ( 0 )
   Conditions (
   Headlight ( 3 )
   Unit ( 2 )
   )
   Cycle ( 0 )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   States ( 1
   State (
   Duration ( 0.0 )
   LightColour ( ff808000 )
   Position ( 0.0357 2.931 4.0 )
   Azimuth ( 0.0 0.0 0.0 )
   Transition ( 0 )
   Radius ( 1.0 )
   Elevation ( 0 -5.0 5.0 )
    )
   )
  )


   Light (
   comment( Lamp front red )
   Type  ( 0 )
   Conditions (
     Headlight ( 2 )
     Unit ( 3 )  
     )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   Cycle ( 0 )
   States ( 1
   State (
     Duration ( 0.0 )
     LightColour ( 80ff0000 )
     Position ( 0.0357 2.931 4.0 ) 
     Azimuth ( 0.0 0.0 0.0 )
     Transition ( 0 )
     Radius ( 0.30 )
     Elevation ( 0 -5.0 5.0 )
     )
    )
   )

   Light (
   comment( Flickering firebox )
   Type  ( 0 )
   Conditions (
   Headlight ( 0 )
   Unit ( 0 )
   )
   FadeIn ( 0.5 )
   FadeOut ( 0.5 )
   Cycle ( 0 )
   States ( 2
   State (
   Duration ( 0.05 )
   LightColour ( eeff8800 )
   Position ( 0 1.75 -2.1 )
   Azimuth ( -180 -180 -180 )
   Transition ( 0 )
   Radius ( 1.3 )
   )
   State (
   Duration ( 0.05 )
   LightColour ( eeff8800 )
   Position ( 0 1.75 -2.1 )
   Azimuth ( -180 -180 -180 )
   Transition ( 0 )
   Radius ( 1.3 )
         
     )
    )
   )

   Light ( 
                  comment( Ashpan flashes ) 
   Type ( 0 ) 
   Conditions ( 
   Headlight ( 3 ) 
   Unit ( 0 ) 
   ) 
   Cycle ( 0 ) 
   FadeIn ( 0 ) 
   FadeOut ( 0.5 ) 
   States ( 28 
   State ( 
   Duration ( 1 ) 
   LightColour ( 00000000 ) 
   Position ( -0.1 0.14 -.695 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 3 ) 
   ) 
   State ( 
   Duration ( 0.1 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -.695 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 2 ) 
   ) 
   State ( 
   Duration ( 0.30 ) 
   LightColour ( 00000000 ) 
   Position ( -0.1 0.14 -.695 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 2 ) 
   ) 
   State ( 
   Duration ( 0.3 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -.695 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 3 ) 
   ) 
   State ( 
   Duration ( 0.1 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -.692 )
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 3 ) 
   ) 
   State ( 
   Duration ( 0.30 ) 
   LightColour ( 00000000 ) 
   Position ( -0.1 0.14 -.692 )
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 3 ) 
   ) 
   State ( 
   Duration ( 0.3 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -.692 )
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 3 ) 
   ) 
   State ( 
   Duration ( 0.1 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -.692 )
   Azimuth ( 90 90 90 ) 
   Transition ( 0 ) 
   Radius ( 2 ) 
   ) 
   State ( 
   Duration ( 0.30 ) 
   LightColour ( 00000000 ) 
   Position ( -0.1 0.14 -.692 )
   Azimuth ( 90 90 90 ) 
   Transition ( 0 ) 
   Radius ( 2 ) 
   ) 
   State ( 
   Duration ( 0.3 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -.695 )
   Azimuth ( 90 90 90 ) 
   Transition ( 0 ) 
   Radius ( 3 ) 
   ) 
   State ( 
   Duration ( 0.1 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -.695 )
   Azimuth ( -180 -180 -180 ) 
   Transition ( 0 ) 
   Radius ( 4 ) 
   ) 
   State ( 
   Duration ( 0.30 ) 
   LightColour ( 00000000 ) 
   Position ( -0.1 0.14 -.695 )
   Azimuth ( -180 -180 -180 ) 
   Transition ( 0 ) 
   Radius ( 3 ) 
   ) 
   State ( 
   Duration ( 0.3 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -.695 )
   Azimuth ( -180 -180 -180 ) 
   Transition ( 0 ) 
   Radius ( 4 ) 
   ) 
   State ( 
   Duration ( 0.5 ) 
   LightColour ( 00000000 ) 
   Position ( -0.1 0.14 -.695 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 3 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -.695 )
   Azimuth ( 90 90 90 ) 
   Transition ( 0 ) 
   Radius ( 4 ) 
   ) 
   State ( 
   Duration ( 0.1 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -.695 )
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 3 ) 
   ) 
   State ( 
   Duration ( 3 ) 
   LightColour ( 00000000 ) 
   Position ( -0.1 0.14 -.695 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 3 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -.695 )
   Azimuth ( -180 -180 -180 ) 
   Transition ( 0 ) 
   Radius ( 2 ) 
   ) 
   State ( 
   Duration ( 0.1 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -.695 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 2 ) 
   ) 
   State ( 
   Duration ( 5 ) 
   LightColour ( 00000000 ) 
   Position ( -0.1 0.14 -.695 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 2 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -.695 )
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 3 ) 
   ) 
   State ( 
   Duration ( 0.30 ) 
   LightColour ( 00000000 ) 
   Position ( -0.1 0.14 -.695 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 3 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -.695 )
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 3 ) 
   ) 
   State ( 
   Duration ( 0.5 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -.695 )
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 3 ) 
   ) 
   State ( 
   Duration ( 0.4 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -.695 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 2 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 00000000 ) 
   Position ( -0.1 0.14 -.695 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 2 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -.695 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 3 ) 
   ) 
   State ( 
   Duration ( 0.6 ) 
   LightColour ( 80ff7200 ) 
   Position ( -0.1 0.14 -.695 )
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 3 ) 
                  )
               )
          )
  Light ( 
                   comment( Chimney Sparks RS1AA ) 
   Type  ( 0 )
   Conditions (
   Headlight ( 3 )
   Unit ( 2 )
   TimeOfDay ( 0 )
   Weather ( 0 )
   Coupling ( 0 )  
   )
   Cycle ( 0 ) 
   FadeIn ( 0 ) 
   FadeOut ( 0.5 ) 
   States ( 28 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 6.22 3.412 )

 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.235 ) 
   ) 
   State ( 
   Duration ( 0.1 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 4.22 3.412 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.235 ) 
   ) 
   State ( 
   Duration ( 0.25 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.42 3.412 )

   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.235 ) 
   ) 
   State ( 
   Duration ( 0.3 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 6.72 3.412 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.230 ) 
   ) 
   State ( 
   Duration ( 0.1 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 4.52 3.412 )
 
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 0.235 ) 
   ) 
   State ( 
   Duration ( 0.25 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 4.72 3.412 )
 
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 0.235 ) 
   ) 
   State ( 
   Duration ( 0.3 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 6.92 3.412 )
 
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 0.230 ) 
   ) 
   State ( 
   Duration ( 0.1 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 4.32 3.412 )
  
   Azimuth ( 90 90 90 ) 
   Transition ( 0 ) 
   Radius ( 0.235 ) 
   ) 
   State ( 
   Duration ( 0.25 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.52 3.412 )
 
   Azimuth ( 90 90 90 ) 
   Transition ( 0 ) 
   Radius ( 0.235 ) 
   ) 
   State ( 
   Duration ( 0.3 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.92 3.412 )
 
   Azimuth ( 90 90 90 ) 
   Transition ( 0 ) 
   Radius ( 0.226 ) 
   ) 
   State ( 
   Duration ( 0.1 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.35 3.412 )
 
   Azimuth ( -180 -180 -180 ) 
   Transition ( 0 ) 
   Radius ( 0.235 ) 
   ) 
   State ( 
   Duration ( 0.25 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.55 3.412 )
 
   Azimuth ( -180 -180 -180 ) 
   Transition ( 0 ) 
   Radius ( 0.25 ) 
   ) 
   State ( 
   Duration ( 0.3 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 6.22 3.412 )
 
   Azimuth ( -180 -180 -180 ) 
   Transition ( 0 ) 
   Radius ( 0.230 ) 
   ) 
   State ( 
   Duration ( 0.25 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 4.22 3.412 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.235 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 4.22 3.412 )
 
   Azimuth ( 90 90 90 ) 
   Transition ( 0 ) 
   Radius ( 0.235 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 6.22 3.412 )
 
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 0.235 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 7.22 3.412 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.235 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.22 3.412 )
 
   Azimuth ( -180 -180 -180 ) 
   Transition ( 0 ) 
   Radius ( 0.235 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.22 3.412 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.235 ) 
   ) 
   State ( 
   Duration ( 0.3 ) 
   LightColour ( 00000000 ) 
   Position ( 0 5.22 3.412 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.235 ) 
   ) 
   State ( 
   Duration ( 0.4 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.22 3.412 )
 
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 0.225 ) 
   ) 
   State ( 
   Duration ( 0.25 ) 
   LightColour ( 00000000 ) 
   Position ( 0 5.22 3.412 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.235 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 6.22 3.412 )
 
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 0.235 ) 
   ) 
   State ( 
   Duration ( 0.5 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.22 3.412 )
 
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 0.235 ) 
   ) 
   State ( 
   Duration ( 0.4 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.22 3.412 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.233 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 00000000 ) 
   Position ( 0 6.22 3.412 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.23 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.22 3.412 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.23 ) 
   ) 
   State ( 
   Duration ( 0.6 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 9.22 3.412 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.230 ) 
                  )
               )
          )

  Light ( 
                  comment( Chimney Sparks RS1AA ) 
   Type  ( 0 )
   Conditions (
   Headlight ( 3 )
   Unit ( 2 )
   TimeOfDay ( 0 )
   Weather ( 0 )
   Coupling ( 0 )  
   )
   Cycle ( 0 ) 
   FadeIn ( 0 ) 
   FadeOut ( 0.5 ) 
   States ( 28 
   State ( 
   Duration ( 0.3 ) 
   LightColour ( 00000000 ) 
   Position ( 0 6.22 3.41 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.235 ) 
   ) 
   State ( 
   Duration ( 0.1 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 6.22 3.41 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.235 ) 
   ) 
   State ( 
   Duration ( 0.25 ) 
   LightColour ( 00000000 ) 
   Position ( 0 6.22 3.41 )

   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.235 ) 
   ) 
   State ( 
   Duration ( 0.3 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 6.22 3.41 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.235 ) 
   ) 
   State ( 
   Duration ( 0.1 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.22 3.41 )
 
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 0.235 ) 
   ) 
   State ( 
   Duration ( 0.25 ) 
   LightColour ( 00000000 ) 
   Position ( 0 7.22 3.41 )
 
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 0.235 ) 
   ) 
   State ( 
   Duration ( 0.3 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.22 3.41 )
 
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 0.234 ) 
   ) 
   State ( 
   Duration ( 0.1 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.22 3.41 )
  
   Azimuth ( 90 90 90 ) 
   Transition ( 0 ) 
   Radius ( 0.235 ) 
   ) 
   State ( 
   Duration ( 0.25 ) 
   LightColour ( 00000000 ) 
   Position ( 0 6.22 3.41 )
 
   Azimuth ( 90 90 90 ) 
   Transition ( 0 ) 
   Radius ( 0.235 ) 
   ) 
   State ( 
   Duration ( 0.3 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 7.22 3.41 )
 
   Azimuth ( 90 90 90 ) 
   Transition ( 0 ) 
   Radius ( 0.234 ) 
   ) 
   State ( 
   Duration ( 0.1 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 7.22 3.41 )
 
   Azimuth ( -180 -180 -180 ) 
   Transition ( 0 ) 
   Radius ( 0.235 ) 
   ) 
   State ( 
   Duration ( 0.25 ) 
   LightColour ( 00000000 ) 
   Position ( 0 6.22 3.41 )
 
   Azimuth ( -180 -180 -180 ) 
   Transition ( 0 ) 
   Radius ( 0.2235 ) 
   ) 
   State ( 
   Duration ( 0.3 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 6.22 3.41 )
 
   Azimuth ( -180 -180 -180 ) 
   Transition ( 0 ) 
   Radius ( 0.23 ) 
   ) 
   State ( 
   Duration ( 0.1 ) 
   LightColour ( 00000000 ) 
   Position ( 0 6.22 3.41 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.235 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 8.22 3.41 )
 
   Azimuth ( 90 90 90 ) 
   Transition ( 0 ) 
   Radius ( 0.235 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 7.22 3.41 )
 
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 0.235 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 00000000 ) 
   Position ( 0 9.22 3.41 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.235 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 6.22 3.41 )
 
   Azimuth ( -180 -180 -180 ) 
   Transition ( 0 ) 
   Radius ( 0.235 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 6.22 3.41 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.236 ) 
   ) 
   State ( 
   Duration ( 0.25 ) 
   LightColour ( 00000000 ) 
   Position ( 0 6.22 3.41 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.235 ) 
   ) 
   State ( 
   Duration ( 0.4 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.22 3.41 )
 
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 0.235 ) 
   ) 
   State ( 
   Duration ( 0.25 ) 
   LightColour ( 00000000 ) 
   Position ( 0 5.22 3.41 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.235 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 6.22 3.41 )
 
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 0.236 ) 
   ) 
   State ( 
   Duration ( 0.5 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 7.22 3.41 )
 
   Azimuth ( -90 -90 -90 ) 
   Transition ( 0 ) 
   Radius ( 0.236 ) 
   ) 
   State ( 
   Duration ( 0.4 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 7.22 3.41 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.235 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 00000000 ) 
   Position ( 0 6.22 3.41 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.235 ) 
   ) 
   State ( 
   Duration ( 0.2 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 5.22 3.41 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.236 ) 
   ) 
   State ( 
   Duration ( 0.6 ) 
   LightColour ( 80ff7200 ) 
   Position ( 0 7.22 3.41 )
 
   Azimuth ( 0 0 0 ) 
   Transition ( 0 ) 
   Radius ( 0.236 ) 
                    )
                 )
            )
   
  Light (
   comment( Flickering Ashpan Front )
   Type  ( 0 )
   Conditions (
   Headlight ( 3 )
   Unit ( 2 )
   )
   FadeIn  ( 0.975 )
   FadeOut ( 0.975 )
   Cycle ( 0 )
   States ( 2
   State (
   Duration ( 0.05 )
   LightColour ( 80ff7200 )
   Position ( -0 0.87 -0.579 )
   Azimuth ( -90 -90 -90 )
   Transition ( 0 )
   Radius ( 1.31)
   )
   State (
   Duration ( 0.05 )
   LightColour ( 80ff7200 )
   Position ( -0 0.87 -0.579 )
   Azimuth ( -180 -180 -180 )
   Transition ( 0 )
   Radius ( 1.3 )
       
     )
    )
   )

   Light (
   comment( Flickering Ashpan Front )
   Type  ( 0 )
   Conditions (
   Headlight ( 0 )
   Unit ( 2 )
   )
   FadeIn ( 0.75 )
   FadeOut ( 0.75 )
   Cycle ( 0 )
   States ( 2
   State (
   Duration ( 0.05 )
   LightColour ( 80ff7200 )
   Position ( -0 0.87 -0.579 )
   Azimuth ( 45 45 45 )
   Transition ( 0 )
   Radius ( 1.3 )
   )
   State (
   Duration ( 0.05 )
   LightColour ( 80ff7200 )
   Position ( -0 0.87 -0.579 )
   Azimuth ( 180 180 180 )
   Transition ( 0 )
   Radius ( 1.31 )
         
     )
    )
   )

   Light (
   comment( Flickering Ashpan Front )
   Type  ( 0 )
   Conditions (
   Headlight ( 3 )
   Unit ( 2 )
   )
   FadeIn ( 1.95 )
   FadeOut ( 1.95 )
   Cycle ( 0 )
   States ( 2
   State (
   Duration ( 0.05 )
   LightColour ( 80ff7200 )
   Position ( -0 0.87 -0.579 )
   Azimuth ( 180 180 180 )
   Transition ( 0 )
   Radius ( 1.3 )
   )
   State (
   Duration ( 0.05 )
   LightColour ( 80ff7200 )
   Position ( -0 0.87 -0.579 )
   Azimuth ( 180 180 180 )
   Transition ( 0 )
   Radius ( 1.310 )
         
     )
    )
   )
  
  )
 )



Engine ( #RF_BR64xx_6431  
 Effects (
  SteamSpecialEffects
  (
   StackFX
   (
    0 3.8 3.406
    0 0.95 0
    0.25
   )
   SafetyValvesFX
   (
    0 3.465 -1.167
    0 0.75 0
    0.25
   )
   WhistleFX
   (
    0 3.38 -1.55
    0 1 0
    0.3
   )
   CylindersFX
   (
    0.224 0.81 3.0
    0.15 -0.3 1.2
    0.1
   )
   CylindersFX
   (
    -0.224 0.81 3.0
    -0.15 -0.3 1.2
    0.1
   )
  )
 )

 Wagon ( #RF_BR64xx_6431 )
 IsTenderRequired( -1 ) 
 Type ( Steam )
 MaxPower ( 678hp )
 MaxForce ( 18013lbf )
 MaxVelocity ( 45mph )
 WheelRadius ( 4.4302m )
 Sanding ( 1e9mph )
 NumWheels ( 1 )
 BoilerLength ( 6.10m )
 BoilerVolume ( "205.37*(ft^3)" )
 BoilerEffectivity ( 1.2 )
 DraftingEffect ( 0.95 )
 BoilerResponsiveness ( 1.05 )
 CoalBurnage ( 4.30lb/hp/h )
 MaxBoilerOutput ( 21204lb/h )
 NumCylinders ( 2 )
 CylinderStroke ( 24in )
 CylinderDiameter ( 16.5in )
 CylinderVolume ( "11.88*(ft^3)" )
 CylinderEffectivity ( 1.40 )
 InjectorSizes ( 9mm 10mm )
 ExhaustLimit ( 23324lb/h )
 PrimingFactor ( 0.95 )
 BlastExponent ( 0.60 )
 MaxBoilerPressure ( 165psi )
 MaxFireMass ( 1090lb )
 IdealFireMass ( 796lb )
 MaxWaterMass ( 4633lb )  
 SafetyValvesSteamUsage ( 7711lb/h )
 ShovelCoalMass ( 10lb )
 SmokeCombustion ( 1.0 ) 
 MaxTenderCoalMass ( 7168lb )
 MaxTenderWaterMass ( 11000lb )
 comment( 0 for live steam, 1 for exhaust steam )
 InjectorTypes( 0 1 )
 Injector1FeedrateMultiplierExhaust ( 1.15 )
      Injector1FeedrateMultiplierLive ( 0.6 )
      Injector2FeedrateMultiplierExhaust ( 1.15 )
      Injector2FeedrateMultiplierLive ( 0.6 )
      Injector1WaterValveVariance ( 0.25 )
      Injector2WaterValveVariance ( 0.25 )

 SuperHeater ( 1.00 )
 SteamSmokeUnitsPerPoundOfFuel( 1.0 )
 SteamMaxSmokeUnitsReleaseRate( 1.0 )
 MaxSteamHeatingPressure( 20 )
 SafetyValvePressureDifference( 7 )
 SteamGaugeGlassHeight( 8.0 )

 SteamFiremanMaxConstantFiringRate ( 3000 )
 SteamFiremanMaxPossibleFiringRate ( 30000 )
 
 BasicSteamUsage ( 20lb/h )
 BasicCoalUsage ( 110lb/h )

  comment( min steam pressure, min water proportion, max water proportion  )
 InjectorLimits1 ( 50psi 0.225 1 )
 InjectorLimits2 ( 60psi 0.225 1 )
 CylinderCocksPowerEfficiency ( 0.9 )
 SteamCylinderCocksOperation( Manual )

      VacuumBrakesSmallEjectorPowerRating( 3.0 )
 VacuumBrakesMinBoilerPressureMaxVacuum( 110 )
 VacuumBrakesSmallEjectorUsageRate( 310 )
 VacuumBrakesLargeEjectorUsageRate( 1000 )
 VacuumBrakesHasVacuumPump( 0 )

 TrainBrakesControllerMaxApplicationRate ( 9 )
 TrainBrakesControllerMaxReleaseRate ( 9 )
 TrainBrakesControllerMinSystemPressure( 0 )
 TrainBrakesControllerMaxSystemPressure( 21 )

 EngineBrakesControllerHasProportionalBrake( 1 )
      EngineBrakesProportionalBrakeLag( 0.9 )

 BrakesEngineBrakeType ( "Vacuum_single_pipe"  )
 BrakesTrainBrakeType ( "Vacuum_single_pipe" )
      BrakesEngineControllers( "Hand, Train" )

 CutoffMaxReverse( 75 )
 CutoffMaxForward( 75 )
 SteamSmallestCutoff( 0.8 )
 NumberOfDamperSteps( 7 )


 RegulatorValveType ( Twin_port )
 RegulatorPilotValveExponent ( 0.5 )
 RegulatorPilotValveInitialOpening( 0.1 )
 RegulatorPilotValveFullOpening( 0.5 )
 RegulatorSecondValveExponent ( 1.75 )
 RegulatorSecondValveStartPosition( 0.5 )
 RegulatorMainValveInitialOpenning( 0.49 )


 SteamBlowerEffectExponent( 0.9 )
 SteamBlowerEfficiencyExponent( 1.1 )
 SteamBlowerMaxSteamUsageRate( 500 ) comment( lbs/h )
 SteamBlowerMaxProportionOfBlastEffect( 0.15 )

 SteamSmokeUnitsPerPoundOfFuel ( 3.3 )
 





        EngineControllers (
        comment( Engine controls )
        
            Regulator ( 0 1 0.025 0 
             NumNotches( 0 )
            )

            Cutoff    ( -0.75 0.75 0.0075 0 
            NumNotches( 15
                Notch ( -0.75    0 Dummy )
                    Notch ( -0.65    0 Dummy )
                    Notch ( -0.55    0 Dummy )
                    Notch ( -0.45    0 Dummy )
    Notch ( -0.35 0 Dummy )
                    Notch ( -0.25 0 Dummy )
    Notch ( -0.15     0 Dummy )
    Notch ( 0.0      0 Dummy )
    Notch ( 0.15    0 Dummy )
                    Notch ( 0.25    0 Dummy )
                    Notch ( 0.35    0 Dummy )
                    Notch ( 0.45    0 Dummy )
    Notch ( 0.55 0 Dummy )
                    Notch ( 0.65 0 Dummy )
    Notch ( 0.75      0 Dummy )
                       
      )
  )
            
            Brake_Train ( 0 1 0.0375 0.65
            NumNotches( 3
            Notch( 0      1 TrainBrakesControllerReleaseStart )
            Notch(0.01   1 TrainBrakesControllerRunningStart )
            Notch(0.2  1 TrainBrakesControllerApplyStart )
                )
            )
            Brake_Hand ( 0 1 0.0125 0 
            NumNotches( 0 )
            )
            FireDoor ( 0 1 0.075 1 
            NumNotches( 0 )
            )
            Sanding( 0 1 0 )
            Blower ( 0 1 0.025 0.02 
            NumNotches( 0 )
            )
            HeatingTap ( 0 1 0.035 0 
            NumNotches( 5 
  Notch ( 0      0 Dummy )
            Notch ( 0.25    0 Dummy )
            Notch ( 0.5    0 Dummy )
            Notch ( 0.75    0 Dummy )
            Notch ( 1    0 Dummy )
    
   )
            )
            Shovel ( 0 1 1 0 
            NumNotches( 5
    Notch ( 0      0 Dummy )
                    Notch ( 0.5    0 Dummy )
                    Notch ( 0.75    0 Dummy )
                    Notch ( 1    0 Dummy )
                    Notch ( 2    0 Dummy )
    
   )
            )
            
                DampersFront ( 0 1 0.1 0.15 
                NumNotches ( 6 
                  Notch ( 0      0 Dummy )
                    Notch ( 0.15    0 Dummy )
                    Notch ( 0.25    0 Dummy )
                    Notch ( 0.5    0 Dummy )
                    Notch ( 0.75    0 Dummy )
    Notch ( 1  0 Dummy )


         
   )
  )
           Injector1Steam ( 0 1 0 )
            Injector2Steam ( 0 1 0 )
            Injector1Water ( 0 1 0.1 0 
                NumNotches( 5 
    Notch ( 0      0 Dummy )
                    Notch ( 0.25    0 Dummy )
                    Notch ( 0.5    0 Dummy )
                    Notch ( 0.75    0 Dummy )
                    Notch ( 1    0 Dummy )

   )
            )
            
            Injector2Water ( 0 1 0.1 0 
            NumNotches( 5 
  Notch ( 0      0 Dummy )
            Notch ( 0.25    0 Dummy )
            Notch ( 0.5    0 Dummy )
            Notch ( 0.75    0 Dummy )
            Notch ( 1    0 Dummy )
         
   )
  )

            CylinderCocks ( 0 1 1 )
            Whistle ( 0 1 0 )
            WaterScoop ( 0 1 0 )
            SmallEjectorOrCompressor( 0 1 0 )
            Headlights( 0 1 0 )
        )
 comment(fire temp, fire mass, water mass, boiler pressure,
  water level, tender_water_mass, tender_coal_mass,
  smoke_quantity, fire_condition, coal quality )
  
 EngineVariables( 900 793 3564 157 1.0 11000 1 1 1 0.85 )

     
     Name ( "#BR 64xx 6431" )
  Description (
  ""
 )
 EngineOperatingProcedures (
 "To move forward\n"+
 "1. Press the W key several times to move the Reverser to full Forward.\n"+
 "2. Press the ; (SEMICOLON) key to release the train brakes.\n"+
 "3. Press the D key to increase the Regulator setting.\n"+  
 "4. As you accelerate, press the S key to slowly reduce the Reverser setting, then adjust the Regulator to maintain the desired speed.\n\n"+
 "To slow the train\n"+
 "1. Press the A key to move the Regulator to a lower setting.\n"+
 "2. Use the brakes to further reduce speed if desired.\n\n"+
 "To apply the train brakes\n"+
 "1. Press the ' (APOSTROPHE) key to apply the train brakes.\n"+
 "2. To hold the brakes at their current setting, lower the brake lever until it's in its middle (Neutral) position, by pressing the ; (SEMICOLON) key.\n\n"+
 "To release the train brakes\n"+
 "1. Press  the ; (SEMICOLON) key to release the train brakes.\n"+
 "2. When the brakes are released, raise the brake lever until it's in its middle (Neutral) position, by pressing the ' (APOSTROPHE) key.\n\n"+
 "To back up\n"+
 "1. Bring your train to a full stop.\n"+ 
 "2. Press the S key several times to move the Reverser to the full Reverse position.\n"+
 "4. Press the ; (SEMICOLON) key to release the brakes.\n"+
 "5. Slowly advance the regulator (D key).\n\n"+
 "To load and unload passengers\n"+
 "1. Stop at a station.\n"+
 "2. Press the ENTER key.\n"+
 "3. Wait for the \"permission to depart\" whistle.\n"+
 "TIP: Use the Next Station driving aid (F10) to monitor loading and unloading.\n\n"+
 "To couple to a car or locomotive\n"+
 "1. Coast into the unit at a very slow speed, about 2 mph.\n"+
 "TIP: To use the Coupling view, press the 6 key.\n"+
 "2. Press F9 to open the Train Operations window.\n"+
 "3. If the icon for the unit you coupled to is red, the handbrake is on. Double-click the car to release the handbrake.\n"+
 "4. Close the Train Operations window.\n\n"+
 "To uncouple from a car or locomotive\n"+
 "1. Press F9 to open the Train Operations window.\n"+
 "2. Double-click a unit in the part of the train you want to uncouple from the locomotive, to set the handbrake.\n"+
 "3. Double-click the coupler between the units you want to uncouple and the rest of the train.\n"+
 "4. Close the Train Operations window.\n\n"+
 "Firing commands (Automatic Fireman OFF in Options screen)\n"+
 "To add coal to the firebox\n"+
 "1. Press the F key to open the Firebox door.\n"+
 "2. Press the R key to increase the shoveling rate.\n\n"+
 "To stop adding coal to the fire\n"+
 "1. Press SHIFT+R to decrease the shoveling rate.\n"+
 "2. Press SHIFT+F to close the firebox door.\n\n"+
 "To operate the blower\n"+
 "1. Press the N key to increase the blower.\n"+
 "2. Press SHIFT+N to decrease the blower.\n\n"+
 "To operate the dampers\n"+
 "1. Press the M key to open the dampers.\n"+
 "2. Press SHIFT+M to close the dampers.\n\n"+
 "To inject water into the boiler\n"+
 "1. Press the I key to turn on the steam to Injector 1.\n"+
 "(You can also press the O key to turn on the steam to Injector 2.)\n"+
 "2. Press the K key to increase the water flow to Injector 1.\n"+
 "(To increase the water flow to Injector 2, press the L key.)\n\n"+
 "To stop boiler water injection\n"+ 
 "1. Press the I key to turn off the steam to Injector 1.\n"+
 "2. Press the O key to turn off the steam to Injector 2."
 )
)
